ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define CAN0CN_SIE__BMASK                      0x04 ///< Status Change Interrupt Enable                    
#define CAN0CN_SIE__SHIFT                      0x02 ///< Status Change Interrupt Enable                    
#define CAN0CN_SIE__STATUS_CHANGE_INT_DISABLED 0x00 ///< Disabled - No status change interrupt will be     
                                                    ///< generated.                                        
#define CAN0CN_SIE__STATUS_CHANGE_INT_ENABLED  0x04 ///< Enabled - An interrupt will be generated when a   
                                                    ///< message transfer is successfully completed or a   
                                                    ///< CAN bus error is detected.                        
                                                                                                           
#define CAN0CN_EIE__BMASK                      0x08 ///< Error Interrupt Enable                            
#define CAN0CN_EIE__SHIFT                      0x03 ///< Error Interrupt Enable                            
#define CAN0CN_EIE__ERROR_INT_DISABLED         0x00 ///< Disabled - No error status interrupt will be      
                                                    ///< generated.                                        
#define CAN0CN_EIE__ERROR_INT_ENABLED          0x08 ///< Enabled - A change in the bits BOFF or EWARN in   
                                                    ///< the CAN0STAT register will generate an interrupt. 
                                                                                                           
#define CAN0CN_DAR__BMASK                      0x20 ///< Automatic Retransmission Disable                  
#define CAN0CN_DAR__SHIFT                      0x05 ///< Automatic Retransmission Disable                  
#define CAN0CN_DAR__AUTO_RETRANS_ENABLED       0x00 ///< Automatic retransmission of disturbed messages    
                                                    ///< enabled.                                          
#define CAN0CN_DAR__AUTO_RETRANS_DISABLED      0x20 ///< Automatic retransmission disabled.                
                                                                                                           
#define CAN0CN_CCE__BMASK                      0x40 ///< Configuration Change Enable                       
#define CAN0CN_CCE__SHIFT                      0x06 ///< Configuration Change Enable                       
#define CAN0CN_CCE__CONFIG_CHANGE_DISABLED     0x00 ///< The core has no write access to the bit timing    
                                                    ///< registers (CAN0BTL and CAN0BTH).                  
#define CAN0CN_CCE__CONFIG_CHANGE_ENABLED      0x40 ///< The core has write access to the bit timing       
                                                    ///< registers (CAN0BTL and CAN0BTH) while the INIT bit
                                                    ///< is set to 1.                                      
                                                                                                           
#define CAN0CN_TEST__BMASK                     0x80 ///< Test Mode Enable                                  
#define CAN0CN_TEST__SHIFT                     0x07 ///< Test Mode Enable                                  
#define CAN0CN_TEST__DISABLED                  0x00 ///< Test mode disabled (normal operation).            
#define CAN0CN_TEST__ENABLED                   0x80 ///< Test mode enabled.                                
                                                                                                           
//------------------------------------------------------------------------------
// CAN0ERRH Enums (CAN Error Counter High @ 0x97)
//------------------------------------------------------------------------------
#define CAN0ERRH_REC__FMASK  0x7F ///< Receive Error Counter                             
#define CAN0ERRH_REC__SHIFT  0x00 ///< Receive Error Counter                             
                                                                                         
#define CAN0ERRH_RP__BMASK   0x80 ///< Receive Error Passive                             
#define CAN0ERRH_RP__SHIFT   0x07 ///< Receive Error Passive                             
#define CAN0ERRH_RP__NOT_SET 0x00 ///< The receive error counter is below the error      
                                  ///< passive level.                                    
#define CAN0ERRH_RP__SET     0x80 ///< The receive error counter has reached the error   
                                  ///< passive level as defined in the CAN specification.
                                                                                         
//------------------------------------------------------------------------------
// CAN0ERRL Enums (CAN Error Counter Low @ 0x96)
//------------------------------------------------------------------------------
#define CAN0ERRL_TEC__FMASK 0xFF ///< Transmit Error Counter
#define CAN0ERRL_TEC__SHIFT 0x00 ///< Transmit Error Counter
                                                            
//------------------------------------------------------------------------------
// CAN0IF1A1H Enums (CAN Interface 1 Arbitration 1 High @ 0xCB)
//------------------------------------------------------------------------------
#define CAN0IF1A1H_ID__FMASK 0xFF ///< Interface 1 Message Identifier
#define CAN0IF1A1H_ID__SHIFT 0x00 ///< Interface 1 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF1A1L Enums (CAN Interface 1 Arbitration 1 Low @ 0xCA)
//------------------------------------------------------------------------------
#define CAN0IF1A1L_ID__FMASK 0xFF ///< Interface 1 Message Identifier
#define CAN0IF1A1L_ID__SHIFT 0x00 ///< Interface 1 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF1A2H Enums (CAN Interface 1 Arbitration 2 High @ 0xCD)
//------------------------------------------------------------------------------
#define CAN0IF1A2H_ID__FMASK       0x1F ///< Interface 1 Message Identifier                   
#define CAN0IF1A2H_ID__SHIFT       0x00 ///< Interface 1 Message Identifier                   
                                                                                              
