ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define CAN0IF1MCH_MSGLST__BMASK   0x40 ///< Message Lost Flag                                 
#define CAN0IF1MCH_MSGLST__SHIFT   0x06 ///< Message Lost Flag                                 
#define CAN0IF1MCH_MSGLST__NOT_SET 0x00 ///< No message was lost since the last time this flag 
                                        ///< was cleared by firmware.                          
#define CAN0IF1MCH_MSGLST__SET     0x40 ///< The message handler stored a new message into this
                                        ///< object when NEWDAT was still set and a message has
                                        ///< been lost.                                        
                                                                                               
#define CAN0IF1MCH_NEWDAT__BMASK   0x80 ///< New Data Flag                                     
#define CAN0IF1MCH_NEWDAT__SHIFT   0x07 ///< New Data Flag                                     
#define CAN0IF1MCH_NEWDAT__NOT_SET 0x00 ///< No new data has been written into the data portion
                                        ///< of this message object by the message handler     
                                        ///< since the last time this flag was cleared by      
                                        ///< firmware.                                         
#define CAN0IF1MCH_NEWDAT__SET     0x80 ///< The message handler or firmware have written new  
                                        ///< data into the data portion of this message object.
                                                                                               
//------------------------------------------------------------------------------
// CAN0IF1MCL Enums (CAN Interface 1 Message Control Low @ 0xD2)
//------------------------------------------------------------------------------
#define CAN0IF1MCL_DLC__FMASK   0x0F ///< Data Length Code                                  
#define CAN0IF1MCL_DLC__SHIFT   0x00 ///< Data Length Code                                  
#define CAN0IF1MCL_DLC__0_BYTES 0x00 ///< The data frame has 0 data bytes.                  
#define CAN0IF1MCL_DLC__1_BYTE  0x01 ///< The data frame has 1 data byte.                   
#define CAN0IF1MCL_DLC__2_BYTES 0x02 ///< The data frame has 2 data bytes.                  
#define CAN0IF1MCL_DLC__3_BYTES 0x03 ///< The data frame has 3 data bytes.                  
#define CAN0IF1MCL_DLC__4_BYTES 0x04 ///< The data frame has 4 data bytes.                  
#define CAN0IF1MCL_DLC__5_BYTES 0x05 ///< The data frame has 5 data bytes.                  
#define CAN0IF1MCL_DLC__6_BYTES 0x06 ///< The data frame has 6 data bytes.                  
#define CAN0IF1MCL_DLC__7_BYTES 0x07 ///< The data frame has 7 data bytes.                  
#define CAN0IF1MCL_DLC__8_BYTES 0x08 ///< The data frame has 8 data bytes.                  
                                                                                            
#define CAN0IF1MCL_EOB__BMASK   0x80 ///< End of Buffer Flag                                
#define CAN0IF1MCL_EOB__SHIFT   0x07 ///< End of Buffer Flag                                
#define CAN0IF1MCL_EOB__NOT_SET 0x00 ///< The message object belongs to a FIFO buffer and is
                                     ///< not the last message object of that FIFO buffer.  
#define CAN0IF1MCL_EOB__SET     0x80 ///< The message object is a single message object or  
                                     ///< the last message object of a FIFO buffer.         
                                                                                            
//------------------------------------------------------------------------------
// CAN0IF2A1H Enums (CAN Interface 2 Arbitration 1 High @ 0xEF)
//------------------------------------------------------------------------------
#define CAN0IF2A1H_ID__FMASK 0xFF ///< Interface 2 Message Identifier
#define CAN0IF2A1H_ID__SHIFT 0x00 ///< Interface 2 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF2A1L Enums (CAN Interface 2 Arbitration 1 Low @ 0xEE)
//------------------------------------------------------------------------------
#define CAN0IF2A1L_ID__FMASK 0xFF ///< Interface 2 Message Identifier
#define CAN0IF2A1L_ID__SHIFT 0x00 ///< Interface 2 Message Identifier
                                                                     
//------------------------------------------------------------------------------
// CAN0IF2A2H Enums (CAN Interface 2 Arbitration 2 High @ 0xF3)
//------------------------------------------------------------------------------
#define CAN0IF2A2H_ID__FMASK       0x1F ///< Interface 2 Message Identifier                   
#define CAN0IF2A2H_ID__SHIFT       0x00 ///< Interface 2 Message Identifier                   
                                                                                              
#define CAN0IF2A2H_DIR__BMASK      0x20 ///< Message Direction                                
#define CAN0IF2A2H_DIR__SHIFT      0x05 ///< Message Direction                                
#define CAN0IF2A2H_DIR__RECEIVE    0x00 ///< Direction = receive. On TXRQST, a remote frame   
                                        ///< with the identifier of this message object is    
                                        ///< transmitted. On reception of a data frame with   
                                        ///< matching identifier, that message is stored in   
                                        ///< this message object.                             
#define CAN0IF2A2H_DIR__TRANSMIT   0x20 ///< Direction = transmit. On TXRQST, the respective  
                                        ///< message object is transmitted as a data frame. On
                                        ///< reception of a remote frame with matching        
                                        ///< identifier, the TXRQST bit of this message object
                                        ///< is set if RMTEN is set to 1.                     
                                                                                              
