ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define CAN0IF2MCH_RMTEN__BMASK    0x02 ///< Remote Enable                                     
#define CAN0IF2MCH_RMTEN__SHIFT    0x01 ///< Remote Enable                                     
#define CAN0IF2MCH_RMTEN__DISABLED 0x00 ///< At the reception of a remote frame, TXRQST is left
                                        ///< unchanged.                                        
#define CAN0IF2MCH_RMTEN__ENABLED  0x02 ///< At the reception of a remote frame, TXRQST is set 
                                        ///< to 1.                                             
                                                                                               
#define CAN0IF2MCH_RXIE__BMASK     0x04 ///< Receive Interrupt Enable                          
#define CAN0IF2MCH_RXIE__SHIFT     0x02 ///< Receive Interrupt Enable                          
#define CAN0IF2MCH_RXIE__DISABLED  0x00 ///< INTPND will be left unchanged after the successful
                                        ///< reception of a frame.                             
#define CAN0IF2MCH_RXIE__ENABLED   0x04 ///< INTPND will be set after a successful reception of
                                        ///< a frame.                                          
                                                                                               
#define CAN0IF2MCH_TXIE__BMASK     0x08 ///< Transmit Interrupt Enable                         
#define CAN0IF2MCH_TXIE__SHIFT     0x03 ///< Transmit Interrupt Enable                         
#define CAN0IF2MCH_TXIE__DISABLED  0x00 ///< INTPND will be left unchanged after the successful
                                        ///< transmission of a frame.                          
#define CAN0IF2MCH_TXIE__ENABLED   0x08 ///< INTPND will be set after a successful transmission
                                        ///< of a frame.                                       
                                                                                               
#define CAN0IF2MCH_UMASK__BMASK    0x10 ///< Use Acceptance Mask                               
#define CAN0IF2MCH_UMASK__SHIFT    0x04 ///< Use Acceptance Mask                               
#define CAN0IF2MCH_UMASK__DISABLED 0x00 ///< Mask ignored.                                     
#define CAN0IF2MCH_UMASK__ENABLED  0x10 ///< Use the mask (MSK, MXTD, and MDIR) for acceptance 
                                        ///< filtering.                                        
                                                                                               
#define CAN0IF2MCH_INTPND__BMASK   0x20 ///< Interrupt Pending Flag                            
#define CAN0IF2MCH_INTPND__SHIFT   0x05 ///< Interrupt Pending Flag                            
#define CAN0IF2MCH_INTPND__NOT_SET 0x00 ///< This message object is not the source of an       
                                        ///< interrupt.                                        
#define CAN0IF2MCH_INTPND__SET     0x20 ///< This message object is the source of an interrupt.
                                        ///< The interrupt identifier in the interrupt register
                                        ///< will point to this message object if there is no  
                                        ///< other interrupt source with higher priority.      
                                                                                               
#define CAN0IF2MCH_MSGLST__BMASK   0x40 ///< Message Lost Flag                                 
#define CAN0IF2MCH_MSGLST__SHIFT   0x06 ///< Message Lost Flag                                 
#define CAN0IF2MCH_MSGLST__NOT_SET 0x00 ///< No message was lost since the last time this flag 
                                        ///< was cleared by firmware.                          
#define CAN0IF2MCH_MSGLST__SET     0x40 ///< The message handler stored a new message into this
                                        ///< object when NEWDAT was still set and a message has
                                        ///< been lost.                                        
                                                                                               
#define CAN0IF2MCH_NEWDAT__BMASK   0x80 ///< New Data Flag                                     
#define CAN0IF2MCH_NEWDAT__SHIFT   0x07 ///< New Data Flag                                     
#define CAN0IF2MCH_NEWDAT__NOT_SET 0x00 ///< No new data has been written into the data portion
                                        ///< of this message object by the message handler     
                                        ///< since the last time this flag was cleared by      
                                        ///< firmware.                                         
#define CAN0IF2MCH_NEWDAT__SET     0x80 ///< The message handler or firmware have written new  
                                        ///< data into the data portion of this message object.
                                                                                               
//------------------------------------------------------------------------------
// CAN0IF2MCL Enums (CAN Interface 2 Message Control Low @ 0xCE)
//------------------------------------------------------------------------------
#define CAN0IF2MCL_DLC__FMASK   0x0F ///< Data Length Code                                  
#define CAN0IF2MCL_DLC__SHIFT   0x00 ///< Data Length Code                                  
#define CAN0IF2MCL_DLC__0_BYTES 0x00 ///< The data frame has 0 data bytes.                  
#define CAN0IF2MCL_DLC__1_BYTE  0x01 ///< The data frame has 1 data byte.                   
#define CAN0IF2MCL_DLC__2_BYTES 0x02 ///< The data frame has 2 data bytes.                  
#define CAN0IF2MCL_DLC__3_BYTES 0x03 ///< The data frame has 3 data bytes.                  
#define CAN0IF2MCL_DLC__4_BYTES 0x04 ///< The data frame has 4 data bytes.                  
#define CAN0IF2MCL_DLC__5_BYTES 0x05 ///< The data frame has 5 data bytes.                  
#define CAN0IF2MCL_DLC__6_BYTES 0x06 ///< The data frame has 6 data bytes.                  
#define CAN0IF2MCL_DLC__7_BYTES 0x07 ///< The data frame has 7 data bytes.                  
#define CAN0IF2MCL_DLC__8_BYTES 0x08 ///< The data frame has 8 data bytes.                  
                                                                                            
#define CAN0IF2MCL_EOB__BMASK   0x80 ///< End of Buffer Flag                                
#define CAN0IF2MCL_EOB__SHIFT   0x07 ///< End of Buffer Flag                                
#define CAN0IF2MCL_EOB__NOT_SET 0x00 ///< The message object belongs to a FIFO buffer and is
                                     ///< not the last message object of that FIFO buffer.  
#define CAN0IF2MCL_EOB__SET     0x80 ///< The message object is a single message object or  
                                     ///< the last message object of a FIFO buffer.         
                                                                                            
//------------------------------------------------------------------------------
// CAN0IIDH Enums (CAN Interrupt High @ 0x9D)
//------------------------------------------------------------------------------
#define CAN0IIDH_INTID__FMASK 0xFF ///< Interrupt Identifier
#define CAN0IIDH_INTID__SHIFT 0x00 ///< Interrupt Identifier
                                                            
//------------------------------------------------------------------------------
// CAN0IIDL Enums (CAN Interrupt Low @ 0x9C)
//------------------------------------------------------------------------------
#define CAN0IIDL_INTID__FMASK 0xFF ///< Interrupt Identifier
#define CAN0IIDL_INTID__SHIFT 0x00 ///< Interrupt Identifier
                                                            
//------------------------------------------------------------------------------
// CAN0IP1H Enums (CAN Interrupt Pending 1 High @ 0xAF)
//------------------------------------------------------------------------------
#define CAN0IP1H_INTPND__FMASK 0xFF ///< Interrupt Pending
#define CAN0IP1H_INTPND__SHIFT 0x00 ///< Interrupt Pending
                                                          
//------------------------------------------------------------------------------
// CAN0IP1L Enums (CAN Interrupt Pending 1 Low @ 0xAE)
//------------------------------------------------------------------------------
#define CAN0IP1L_INTPND__FMASK 0xFF ///< Interrupt Pending
#define CAN0IP1L_INTPND__SHIFT 0x00 ///< Interrupt Pending
                                                          
//------------------------------------------------------------------------------
// CAN0IP2H Enums (CAN Interrupt Pending 2 High @ 0xB3)
//------------------------------------------------------------------------------
#define CAN0IP2H_INTPND__FMASK 0xFF ///< Interrupt Pending
#define CAN0IP2H_INTPND__SHIFT 0x00 ///< Interrupt Pending
                                                          
//------------------------------------------------------------------------------
// CAN0IP2L Enums (CAN Interrupt Pending 2 Low @ 0xB2)
//------------------------------------------------------------------------------
#define CAN0IP2L_INTPND__FMASK 0xFF ///< Interrupt Pending
#define CAN0IP2L_INTPND__SHIFT 0x00 ///< Interrupt Pending
                                                          
//------------------------------------------------------------------------------
// CAN0MV1H Enums (CAN Message Valid 1 High @ 0xBB)
//------------------------------------------------------------------------------
#define CAN0MV1H_MSGVAL__FMASK 0xFF ///< Message Valid
#define CAN0MV1H_MSGVAL__SHIFT 0x00 ///< Message Valid
                                                      
//------------------------------------------------------------------------------
// CAN0MV1L Enums (CAN Message Valid 1 Low @ 0xBA)
//------------------------------------------------------------------------------
#define CAN0MV1L_MSGVAL__FMASK 0xFF ///< Message Valid
#define CAN0MV1L_MSGVAL__SHIFT 0x00 ///< Message Valid
                                                      
//------------------------------------------------------------------------------
// CAN0MV2H Enums (CAN Message Valid 2 High @ 0xBD)
//------------------------------------------------------------------------------
#define CAN0MV2H_MSGVAL__FMASK 0xFF ///< Message Valid
#define CAN0MV2H_MSGVAL__SHIFT 0x00 ///< Message Valid
                                                      
//------------------------------------------------------------------------------
// CAN0MV2L Enums (CAN Message Valid 2 Low @ 0xBC)
//------------------------------------------------------------------------------
#define CAN0MV2L_MSGVAL__FMASK 0xFF ///< Message Valid
#define CAN0MV2L_MSGVAL__SHIFT 0x00 ///< Message Valid
                                                      
//------------------------------------------------------------------------------
// CAN0ND1H Enums (CAN New Data 1 High @ 0xAB)
//------------------------------------------------------------------------------
#define CAN0ND1H_NEWDAT__FMASK 0xFF ///< New Data
#define CAN0ND1H_NEWDAT__SHIFT 0x00 ///< New Data
                                                 
//------------------------------------------------------------------------------
// CAN0ND1L Enums (CAN New Data 1 Low @ 0xAA)
//------------------------------------------------------------------------------
#define CAN0ND1L_NEWDAT__FMASK 0xFF ///< New Data
#define CAN0ND1L_NEWDAT__SHIFT 0x00 ///< New Data
                                                 
//------------------------------------------------------------------------------
// CAN0ND2H Enums (CAN New Data 2 High @ 0xAD)
//------------------------------------------------------------------------------
#define CAN0ND2H_NEWDAT__FMASK 0xFF ///< New Data
#define CAN0ND2H_NEWDAT__SHIFT 0x00 ///< New Data
                                                 
//------------------------------------------------------------------------------
// CAN0ND2L Enums (CAN New Data 2 Low @ 0xAC)
//------------------------------------------------------------------------------
#define CAN0ND2L_NEWDAT__FMASK 0xFF ///< New Data
#define CAN0ND2L_NEWDAT__SHIFT 0x00 ///< New Data
                                                 
//------------------------------------------------------------------------------
// CAN0STAT Enums (CAN Status @ 0x94)
//------------------------------------------------------------------------------
#define CAN0STAT_LEC__FMASK       0x07 ///< Last Error Code                                   
#define CAN0STAT_LEC__SHIFT       0x00 ///< Last Error Code                                   
#define CAN0STAT_LEC__NO_ERROR    0x00 ///< No error.                                         
#define CAN0STAT_LEC__STUFF_ERROR 0x01 ///< More than 5 equal bits in a sequence have occurred
                                       ///< in a part of a received message where this is not 
                                       ///< allowed.                                          
#define CAN0STAT_LEC__FORM_ERROR  0x02 ///< A fixed format part of a received frame has the   
                                       ///< wrong format.                                     
#define CAN0STAT_LEC__ACK_ERROR   0x03 ///< The message this CAN module transmitted was not   
                                       ///< acknowledged by another node.                     
#define CAN0STAT_LEC__BIT1_ERROR  0x04 ///< During the transmission of a message (with the    
                                       ///< exception of the arbitration field), the device   
                                       ///< wanted to send a recessive level (bit of logical  
                                       ///< value 1), but the monitored bus value was         
                                       ///< dominant.                                         
#define CAN0STAT_LEC__BIT0_ERROR  0x05 ///< During the transmission of a message, acknowledge 
                                       ///< bit, active error flag, or overload flag, the     
                                       ///< device wanted to send a dominant level (data or   
                                       ///< identifier bit logical value 0), but the monitored
                                       ///< bus value was recessive. During busoff recovery,  
                                       ///< this status is set each time a sequence of 11     
                                       ///< recessive bits has been monitored. This enables   
                                       ///< the CAN module to monitor the proceeding of the   
                                       ///< busoff recovery sequence (indicating the bus is   
                                       ///< not stuck at dominant or continuously disturbed). 
#define CAN0STAT_LEC__CRC_ERROR   0x06 ///< The CRC checksum was incorrect in the message     
                                       ///< received; the CRC received for an incoming message
                                       ///< does not match with the calculated CRC for the    
                                       ///< received data.                                    
                                                                                              
#define CAN0STAT_TXOK__BMASK      0x08 ///< Message Transmit Flag                             
#define CAN0STAT_TXOK__SHIFT      0x03 ///< Message Transmit Flag                             
#define CAN0STAT_TXOK__NOT_SET    0x00 ///< Since this bit was last reset, no message has bee 
                                       ///< successfully transmitted.                         
#define CAN0STAT_TXOK__SET        0x08 ///< Since this bit was last reset, a message has been 
                                       ///< successfully (error free and acknowledged by at   
                                       ///< least one other node) transmitted.                
                                                                                              
#define CAN0STAT_RXOK__BMASK      0x10 ///< Message Receive Flag                              
#define CAN0STAT_RXOK__SHIFT      0x04 ///< Message Receive Flag                              
#define CAN0STAT_RXOK__NOT_SET    0x00 ///< Since this bit was last reset, no message has bee 
                                       ///< successfully received.                            
#define CAN0STAT_RXOK__SET        0x10 ///< Since this bit was last reset, a message has been 
                                       ///< successfully  received independent of the result  
                                       ///< of acceptance filtering.                          
                                                                                              
#define CAN0STAT_EPASS__BMASK     0x20 ///< Error Passive Flag                                
#define CAN0STAT_EPASS__SHIFT     0x05 ///< Error Passive Flag                                
#define CAN0STAT_EPASS__NOT_SET   0x00 ///< The CAN module is in the error passive state as   
                                       ///< defined by the CAN specification.                 
#define CAN0STAT_EPASS__SET       0x20 ///< The CAN module is error active.                   
                                                                                              
