ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define CAN0STAT_EWARN__BMASK     0x40 ///< Warning Status Flag                               
#define CAN0STAT_EWARN__SHIFT     0x06 ///< Warning Status Flag                               
#define CAN0STAT_EWARN__NOT_SET   0x00 ///< Both error counters are below the error warning   
                                       ///< limit of 96.                                      
#define CAN0STAT_EWARN__SET       0x40 ///< At least one of the error counters has reached the
                                       ///< error warning limit of 96.                        
                                                                                              
#define CAN0STAT_BOFF__BMASK      0x80 ///< Busoff Status Flag                                
#define CAN0STAT_BOFF__SHIFT      0x07 ///< Busoff Status Flag                                
#define CAN0STAT_BOFF__NOT_SET    0x00 ///< The CAN module is not busoff.                     
#define CAN0STAT_BOFF__SET        0x80 ///< The CAN module is in busoff state.                
                                                                                              
//------------------------------------------------------------------------------
// CAN0TR1H Enums (CAN Transmission Request 1 High @ 0xA3)
//------------------------------------------------------------------------------
#define CAN0TR1H_TXRQST__FMASK 0xFF ///< Transmission Request
#define CAN0TR1H_TXRQST__SHIFT 0x00 ///< Transmission Request
                                                             
//------------------------------------------------------------------------------
// CAN0TR1L Enums (CAN Transmission Request 1 Low @ 0xA2)
//------------------------------------------------------------------------------
#define CAN0TR1L_TXRQST__FMASK 0xFF ///< Transmission Request
#define CAN0TR1L_TXRQST__SHIFT 0x00 ///< Transmission Request
                                                             
//------------------------------------------------------------------------------
// CAN0TR2H Enums (CAN Transmission Request 2 High @ 0xA5)
//------------------------------------------------------------------------------
#define CAN0TR2H_TXRQST__FMASK 0xFF ///< Transmission Request
#define CAN0TR2H_TXRQST__SHIFT 0x00 ///< Transmission Request
                                                             
//------------------------------------------------------------------------------
// CAN0TR2L Enums (CAN Transmission Request 2 Low @ 0xA4)
//------------------------------------------------------------------------------
#define CAN0TR2L_TXRQST__FMASK 0xFF ///< Transmission Request
#define CAN0TR2L_TXRQST__SHIFT 0x00 ///< Transmission Request
                                                             
//------------------------------------------------------------------------------
// CAN0TST Enums (CAN Test @ 0x9E)
//------------------------------------------------------------------------------
#define CAN0TST_BASIC__BMASK      0x04 ///< Basic Mode                                       
#define CAN0TST_BASIC__SHIFT      0x02 ///< Basic Mode                                       
#define CAN0TST_BASIC__DISABLED   0x00 ///< Basic mode disabled.                             
#define CAN0TST_BASIC__ENABLED    0x04 ///< IF1 registers are used as the TX buffer, and IF2 
                                       ///< registers are used as the RX buffer.             
                                                                                             
#define CAN0TST_SILENT__BMASK     0x08 ///< Silent Mode                                      
#define CAN0TST_SILENT__SHIFT     0x03 ///< Silent Mode                                      
#define CAN0TST_SILENT__DISABLED  0x00 ///< Disable silent mode (normal operation).          
#define CAN0TST_SILENT__ENABLED   0x08 ///< Enable silent mode.                              
                                                                                             
#define CAN0TST_LBACK__BMASK      0x10 ///< Loop Back Mode                                   
#define CAN0TST_LBACK__SHIFT      0x04 ///< Loop Back Mode                                   
#define CAN0TST_LBACK__DISABLED   0x00 ///< Loop back mode is disabled.                      
#define CAN0TST_LBACK__ENABLED    0x10 ///< Loop back mode is enabled.                       
                                                                                             
#define CAN0TST_TX__FMASK         0x60 ///< Transmit Pin Mode                                
#define CAN0TST_TX__SHIFT         0x05 ///< Transmit Pin Mode                                
#define CAN0TST_TX__HW_CONTROLLED 0x00 ///< CAN0_TX is controlled by the CAN module.         
#define CAN0TST_TX__SAMPLE        0x20 ///< Sample point can be monitored at the CAN0_TX pin.
#define CAN0TST_TX__DOMINANT      0x40 ///< CAN0_TX drives a dominant value (0).             
#define CAN0TST_TX__RECESSIVE     0x60 ///< CAN0_TX drives a recessive value (1).            
                                                                                             
#define CAN0TST_RX__BMASK         0x80 ///< Receive Pin Status                               
#define CAN0TST_RX__SHIFT         0x07 ///< Receive Pin Status                               
#define CAN0TST_RX__DOMINANT      0x00 ///< The CAN bus is dominant (CAN0_RX is 0).          
#define CAN0TST_RX__RECESSIVE     0x80 ///< The CAN bus is recessive (CAN0_RX is 1).         
                                                                                             
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
