ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define LIN0ERR_TOUT__BMASK     0x04 ///< Timeout Error Flag                              
#define LIN0ERR_TOUT__SHIFT     0x02 ///< Timeout Error Flag                              
#define LIN0ERR_TOUT__NOT_SET   0x00 ///< A timeout error has not been detected.          
#define LIN0ERR_TOUT__SET       0x04 ///< A timeout error has been detected.              
                                                                                          
#define LIN0ERR_PRTY__BMASK     0x08 ///< Parity Error Flag                               
#define LIN0ERR_PRTY__SHIFT     0x03 ///< Parity Error Flag                               
#define LIN0ERR_PRTY__NOT_SET   0x00 ///< No parity error has been detected.              
#define LIN0ERR_PRTY__SET       0x08 ///< A parity error has been detected.               
                                                                                          
#define LIN0ERR_SYNCH__BMASK    0x10 ///< Synchronization Error Flag                      
#define LIN0ERR_SYNCH__SHIFT    0x04 ///< Synchronization Error Flag                      
#define LIN0ERR_SYNCH__NOT_SET  0x00 ///< No error with the SYNCH FIELD has been detected.
#define LIN0ERR_SYNCH__SET      0x10 ///< Edges of the SYNCH FIELD are outside of the     
                                     ///< maximum tolerance.                              
                                                                                          
//------------------------------------------------------------------------------
// LIN0ID Enums (LIN0 Identifier @ 0x0E)
//------------------------------------------------------------------------------
#define LIN0ID_ID__FMASK   0x3F ///< LIN Identifier                                  
#define LIN0ID_ID__SHIFT   0x00 ///< LIN Identifier                                  
#define LIN0ID_ID__2_BYTES 0x00 ///< If LINSIZE is set to 15, select a data size of 2
                                ///< bytes.                                          
#define LIN0ID_ID__4_BYTES 0x02 ///< If LINSIZE is set to 15, select a data size of 4
                                ///< bytes.                                          
#define LIN0ID_ID__8_BYTES 0x03 ///< If LINSIZE is set to 15, select a data size of 8
                                ///< bytes.                                          
                                                                                     
//------------------------------------------------------------------------------
// LIN0MUL Enums (LIN0 Multiplier @ 0x0D)
//------------------------------------------------------------------------------
#define LIN0MUL_LINDIV__BMASK 0x01 ///< Baud Rate Divider High Bit
#define LIN0MUL_LINDIV__SHIFT 0x00 ///< Baud Rate Divider High Bit
                                                                  
#define LIN0MUL_LINMUL__FMASK 0x3E ///< Baud Rate Multiplier      
#define LIN0MUL_LINMUL__SHIFT 0x01 ///< Baud Rate Multiplier      
                                                                  
#define LIN0MUL_PRESCL__FMASK 0xC0 ///< Baud Rate Prescaler       
#define LIN0MUL_PRESCL__SHIFT 0x06 ///< Baud Rate Prescaler       
                                                                  
//------------------------------------------------------------------------------
// LIN0SIZE Enums (LIN0 Size @ 0x0B)
//------------------------------------------------------------------------------
#define LIN0SIZE_LINSIZE__FMASK        0x0F ///< Data Field Size                                  
#define LIN0SIZE_LINSIZE__SHIFT        0x00 ///< Data Field Size                                  
#define LIN0SIZE_LINSIZE__0_DATA_BYTES 0x00 ///< Select 0 data bytes.                             
#define LIN0SIZE_LINSIZE__1_DATA_BYTE  0x01 ///< Select 1 data byte.                              
#define LIN0SIZE_LINSIZE__2_DATA_BYTES 0x02 ///< Select 2 data bytes.                             
#define LIN0SIZE_LINSIZE__3_DATA_BYTES 0x03 ///< Select 3 data bytes.                             
#define LIN0SIZE_LINSIZE__4_DATA_BYTES 0x04 ///< Select 4 data bytes.                             
#define LIN0SIZE_LINSIZE__5_DATA_BYTES 0x05 ///< Select 5 data bytes.                             
#define LIN0SIZE_LINSIZE__6_DATA_BYTES 0x06 ///< Select 6 data bytes.                             
#define LIN0SIZE_LINSIZE__7_DATA_BYTES 0x07 ///< Select 7 data bytes.                             
#define LIN0SIZE_LINSIZE__8_DATA_BYTES 0x08 ///< Select 8 data bytes.                             
#define LIN0SIZE_LINSIZE__USE_ID       0x0F ///< Use the ID bits to determine the data length.    
                                                                                                  
#define LIN0SIZE_ENHCHK__BMASK         0x80 ///< Checksum Selection                               
#define LIN0SIZE_ENHCHK__SHIFT         0x07 ///< Checksum Selection                               
#define LIN0SIZE_ENHCHK__CLASSIC       0x00 ///< Use the classic checksum compliant with          
                                            ///< specification 1.3. The checksum covers the data  
                                            ///< bytes.                                           
#define LIN0SIZE_ENHCHK__ENHANCED      0x80 ///< Use the enhanced checksum compliant with         
                                            ///< specification 2.0. The checksum covers data bytes
                                            ///< and the protected identifier.                    
                                                                                                  
//------------------------------------------------------------------------------
// LIN0ST Enums (LIN0 Status @ 0x09)
//------------------------------------------------------------------------------
#define LIN0ST_DONE__BMASK      0x01 ///< Transmission Complete Flag                        
#define LIN0ST_DONE__SHIFT      0x00 ///< Transmission Complete Flag                        
#define LIN0ST_DONE__NOT_SET    0x00 ///< A transmission is not in progress or has not been 
                                     ///< started. Hardware clears this bit at the start of 
                                     ///< a transmission.                                   
#define LIN0ST_DONE__SET        0x01 ///< The current transmission is complete.             
                                                                                            
