ahtn/keyplus/efm8/efm8/mcu/C8051F500/inc/SI_C8051F500_Register_Enums.h
#define P3MASK_B3__BMASK    0x08 ///< Port 3 Bit 3 Mask Value                           
#define P3MASK_B3__SHIFT    0x03 ///< Port 3 Bit 3 Mask Value                           
#define P3MASK_B3__IGNORED  0x00 ///< P3.3 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P3MASK_B3__COMPARED 0x08 ///< P3.3 pin logic value is compared to P3MAT.3.      
                                                                                        
#define P3MASK_B4__BMASK    0x10 ///< Port 3 Bit 4 Mask Value                           
#define P3MASK_B4__SHIFT    0x04 ///< Port 3 Bit 4 Mask Value                           
#define P3MASK_B4__IGNORED  0x00 ///< P3.4 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P3MASK_B4__COMPARED 0x10 ///< P3.4 pin logic value is compared to P3MAT.4.      
                                                                                        
#define P3MASK_B5__BMASK    0x20 ///< Port 3 Bit 5 Mask Value                           
#define P3MASK_B5__SHIFT    0x05 ///< Port 3 Bit 5 Mask Value                           
#define P3MASK_B5__IGNORED  0x00 ///< P3.5 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P3MASK_B5__COMPARED 0x20 ///< P3.5 pin logic value is compared to P3MAT.5.      
                                                                                        
#define P3MASK_B6__BMASK    0x40 ///< Port 3 Bit 6 Mask Value                           
#define P3MASK_B6__SHIFT    0x06 ///< Port 3 Bit 6 Mask Value                           
#define P3MASK_B6__IGNORED  0x00 ///< P3.6 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P3MASK_B6__COMPARED 0x40 ///< P3.6 pin logic value is compared to P3MAT.6.      
                                                                                        
#define P3MASK_B7__BMASK    0x80 ///< Port 3 Bit 7 Mask Value                           
#define P3MASK_B7__SHIFT    0x07 ///< Port 3 Bit 7 Mask Value                           
#define P3MASK_B7__IGNORED  0x00 ///< P3.7 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.                            
#define P3MASK_B7__COMPARED 0x80 ///< P3.7 pin logic value is compared to P3MAT.7.      
                                                                                        
//------------------------------------------------------------------------------
// P3MAT Enums (Port 3 Match @ 0xAE)
//------------------------------------------------------------------------------
#define P3MAT_B0__BMASK 0x01 ///< Port 3 Bit 0 Match Value                         
#define P3MAT_B0__SHIFT 0x00 ///< Port 3 Bit 0 Match Value                         
#define P3MAT_B0__LOW   0x00 ///< P3.0 pin logic value is compared with logic LOW. 
#define P3MAT_B0__HIGH  0x01 ///< P3.0 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B1__BMASK 0x02 ///< Port 3 Bit 1 Match Value                         
#define P3MAT_B1__SHIFT 0x01 ///< Port 3 Bit 1 Match Value                         
#define P3MAT_B1__LOW   0x00 ///< P3.1 pin logic value is compared with logic LOW. 
#define P3MAT_B1__HIGH  0x02 ///< P3.1 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B2__BMASK 0x04 ///< Port 3 Bit 2 Match Value                         
#define P3MAT_B2__SHIFT 0x02 ///< Port 3 Bit 2 Match Value                         
#define P3MAT_B2__LOW   0x00 ///< P3.2 pin logic value is compared with logic LOW. 
#define P3MAT_B2__HIGH  0x04 ///< P3.2 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B3__BMASK 0x08 ///< Port 3 Bit 3 Match Value                         
#define P3MAT_B3__SHIFT 0x03 ///< Port 3 Bit 3 Match Value                         
#define P3MAT_B3__LOW   0x00 ///< P3.3 pin logic value is compared with logic LOW. 
#define P3MAT_B3__HIGH  0x08 ///< P3.3 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B4__BMASK 0x10 ///< Port 3 Bit 4 Match Value                         
#define P3MAT_B4__SHIFT 0x04 ///< Port 3 Bit 4 Match Value                         
#define P3MAT_B4__LOW   0x00 ///< P3.4 pin logic value is compared with logic LOW. 
#define P3MAT_B4__HIGH  0x10 ///< P3.4 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B5__BMASK 0x20 ///< Port 3 Bit 5 Match Value                         
#define P3MAT_B5__SHIFT 0x05 ///< Port 3 Bit 5 Match Value                         
#define P3MAT_B5__LOW   0x00 ///< P3.5 pin logic value is compared with logic LOW. 
#define P3MAT_B5__HIGH  0x20 ///< P3.5 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B6__BMASK 0x40 ///< Port 3 Bit 6 Match Value                         
#define P3MAT_B6__SHIFT 0x06 ///< Port 3 Bit 6 Match Value                         
#define P3MAT_B6__LOW   0x00 ///< P3.6 pin logic value is compared with logic LOW. 
#define P3MAT_B6__HIGH  0x40 ///< P3.6 pin logic value is compared with logic HIGH.
                                                                                   
#define P3MAT_B7__BMASK 0x80 ///< Port 3 Bit 7 Match Value                         
#define P3MAT_B7__SHIFT 0x07 ///< Port 3 Bit 7 Match Value                         
#define P3MAT_B7__LOW   0x00 ///< P3.7 pin logic value is compared with logic LOW. 
#define P3MAT_B7__HIGH  0x80 ///< P3.7 pin logic value is compared with logic HIGH.
                                                                                   
//------------------------------------------------------------------------------
// P3MDIN Enums (Port 3 Input Mode @ 0xF4)
//------------------------------------------------------------------------------
#define P3MDIN_B0__BMASK   0x01 ///< Port 3 Bit 0 Input Mode                 
#define P3MDIN_B0__SHIFT   0x00 ///< Port 3 Bit 0 Input Mode                 
#define P3MDIN_B0__ANALOG  0x00 ///< P3.0 pin is configured for analog mode. 
#define P3MDIN_B0__DIGITAL 0x01 ///< P3.0 pin is configured for digital mode.
                                                                             
#define P3MDIN_B1__BMASK   0x02 ///< Port 3 Bit 1 Input Mode                 
#define P3MDIN_B1__SHIFT   0x01 ///< Port 3 Bit 1 Input Mode                 
#define P3MDIN_B1__ANALOG  0x00 ///< P3.1 pin is configured for analog mode. 
#define P3MDIN_B1__DIGITAL 0x02 ///< P3.1 pin is configured for digital mode.
                                                                             
#define P3MDIN_B2__BMASK   0x04 ///< Port 3 Bit 2 Input Mode                 
#define P3MDIN_B2__SHIFT   0x02 ///< Port 3 Bit 2 Input Mode                 
#define P3MDIN_B2__ANALOG  0x00 ///< P3.2 pin is configured for analog mode. 
#define P3MDIN_B2__DIGITAL 0x04 ///< P3.2 pin is configured for digital mode.
                                                                             
#define P3MDIN_B3__BMASK   0x08 ///< Port 3 Bit 3 Input Mode                 
#define P3MDIN_B3__SHIFT   0x03 ///< Port 3 Bit 3 Input Mode                 
#define P3MDIN_B3__ANALOG  0x00 ///< P3.3 pin is configured for analog mode. 
#define P3MDIN_B3__DIGITAL 0x08 ///< P3.3 pin is configured for digital mode.
                                                                             
